[Reference](https://medium.com/analytics-vidhya/pandas-explode-b162e7a85d3f)

In [1]:
import pandas as pd

In [2]:
coll= {'dept':[100,200,300], 
       'name': ['Kang|Kim', 'Lee|Park|Choi', 
                'Cha|Na']} 
coll_df=pd.DataFrame(coll)
coll_df.head()

   dept           name
0   100       Kang|Kim
1   200  Lee|Park|Choi
2   300         Cha|Na

# Method1: Using pandas split() and concat() method

In [3]:
#create new data frame with split value columns 
#seperates data into three columns as per separator mentioned
new = coll_df["name"].str.split("|",expand = True) 
# making separate first name column from new data frame 
#assign columnn values to dataframe new columns named as name*
coll_df["Name1"]= new[0] 
coll_df["Name2"]= new[1] 
coll_df["Name3"]= new[2] 
# Dropping old Name columns 
coll_df.drop(columns =["name"], inplace = True)

In [4]:
#create seperate dataframes with two columns
#id,name
d_name1=coll_df[['dept','Name1']]
d_name2=coll_df[['dept','Name2']]
d_name3=coll_df[['dept','Name3']]

In [5]:
#perform concat/unions operation for vertical merging of dataframes
union_df=pd.concat([d_name1,d_name2,d_name3],ignore_index=True)
union_df.fillna('',inplace=True)
#concatenate values of series into one series “name”
union_df['name']=union_df['Name1'].astype(str)+union_df['Name2'].astype(str)+union_df['Name3'].astype(str)

In [6]:
#drop column names
union_df.drop(['Name1','Name2','Name3'],axis=1,inplace=True)
#drop rows having empty values
final_df=union_df[union_df['name']!='']
#sort the dataframe data by dept values
final_df.sort_values('dept')

   dept  name
0   100  Kang
3   100   Kim
1   200   Lee
4   200  Park
7   200  Choi
2   300   Cha
5   300    Na

# Method 2: Using split() and stack()

In [8]:
coll= {'dept':[100,200,300], 
       'name': ['Kang|Kim', 'Lee|Park|Choi', 
                'Cha|Na']} 
coll_df=pd.DataFrame(coll)
coll_df.head()

   dept           name
0   100       Kang|Kim
1   200  Lee|Park|Choi
2   300         Cha|Na

In [9]:
#convert series into string using str method
#split the string on basis of pipe delimiter
#convert the series into list uing to_list method
#stack performs the final step of transpose or pivot
df1 = pd.DataFrame(coll_df.name.str.split('|').to_list(),index=coll_df.dept).stack()

In [10]:
df1

dept
100   0    Kang
      1     Kim
200   0     Lee
      1    Park
      2    Choi
300   0     Cha
      1      Na
dtype: object

In [11]:
df_new = df1.reset_index([0,'dept'])
df_new

   dept     0
0   100  Kang
1   100   Kim
2   200   Lee
3   200  Park
4   200  Choi
5   300   Cha
6   300    Na

In [12]:
df_new.columns=['Dept','Name']
df_new

   Dept  Name
0   100  Kang
1   100   Kim
2   200   Lee
3   200  Park
4   200  Choi
5   300   Cha
6   300    Na

# Method 3: Using split() and explode()- the Python way

In [13]:
coll= {'dept':[100,200,300], 
       'name': ['Kang|Kim', 'Lee|Park|Choi', 
                'Cha|Na']} 
coll_df=pd.DataFrame(coll)
coll_df.head()

   dept           name
0   100       Kang|Kim
1   200  Lee|Park|Choi
2   300         Cha|Na

In [14]:
df_exp = coll_df.assign(name = coll_df['name'].str.split('|')).explode('name')
df_exp

   dept  name
0   100  Kang
0   100   Kim
1   200   Lee
1   200  Park
1   200  Choi
2   300   Cha
2   300    Na